Revit 2026 API

# ExporterIFCSet3DContextHandle Method

---

Sets the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Set3DContextHandle(
	IFCAnyHandle contextHandle,
	string subContextName
)
```
```vb
Public Sub Set3DContextHandle (
	contextHandle As IFCAnyHandle,
	subContextName As String
)
```
```cpp
public:
void Set3DContextHandle(
	IFCAnyHandle^ contextHandle,
	String^ subContextName
)
```
```fsharp
member Set3DContextHandle :
        contextHandle : IFCAnyHandle *
        subContextName : string -> unit
```

#### Parameters

contextHandle IFCAnyHandle
     The IfcRepresentationContext for 3D entities.
subContextName String
     The name of the IfcRepresentationSubContext, or the IfcRepresentationContext if the string is empty, for 3D entities.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace